Revit 2026 API

# ControlledApplicationDocumentReloadingLatest Event

---

Subscribe to the DocumentReloadingLatestEventArgs event to be notified when Revit is just about to reload latest changes from a central model.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public event EventHandler<DocumentReloadingLatestEventArgs> DocumentReloadingLatest
```
```vb
Public Event DocumentReloadingLatest As EventHandler(Of DocumentReloadingLatestEventArgs)
```
```cpp
public:
 event EventHandler<DocumentReloadingLatestEventArgs^>^ DocumentReloadingLatest {
	void add (EventHandler<DocumentReloadingLatestEventArgs^>^ value);
	void remove (EventHandler<DocumentReloadingLatestEventArgs^>^ value);
}
```
```fsharp
member DocumentReloadingLatest : IEvent<EventHandler<DocumentReloadingLatestEventArgs>,
    DocumentReloadingLatestEventArgs>
```

#### Value

EventHandlerDocumentReloadingLatestEventArgs

This event is raised when Revit is just about to reload latest changes from a central model.

Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read - only mode.

Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True. Your application is responsible for providing feedback to the user about the reason for the cancellation.

The following API functions are not available for the current document during this event:

  * Close and similar overloads.
  * Save .
  * SaveAs(String) and similar overloads.

Exception InvalidOperationException will be thrown if any of the above methods is called during this event.

Another DocumentReloadingLatest event will be raised immediately after document synchronizing with central model is finished.

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace